<!DOCTYPE HTML>
<html lang="en" >
    <head>
<meta charset="UTF-8">
<meta content="text/html; charset=utf-8" http-equiv="Content-Type"><title>繼承 </title><meta http-equiv="X-UA-Compatible" content="IE=edge" />
<meta name="description" content="Cici's notebook."><meta name="keywords" content="c++, inheritance" /><meta name="seo" content="no seo" /><link rel="stylesheet" href="/assets/gitbook/style.css">
<link rel="stylesheet" href="/assets/gitbook/gitbook-plugin-back-to-top-button/plugin.css">
<link rel="stylesheet" href="/assets/gitbook/gitbook-plugin-expandable-chapters-small2/expandable-chapters-small.css">
<link rel="stylesheet" href="/assets/gitbook/gitbook-plugin-fontsettings/website.css">
<link rel="stylesheet" href="/assets/gitbook/gitbook-plugin-search-pro/search.css">
<link rel="stylesheet" href="/assets/gitbook/gitbook-plugin-splitter/splitter.css">

<link rel="stylesheet" href="/assets/gitbook/rouge/base16.css">

<link rel="stylesheet" href="/assets/gitbook/custom.css">
<link rel="stylesheet" href="/assets/gitbook/custom-local.css">
<meta name="google-site-verification" content="65zgvtfJFNDdKge0tDpfLKShsOrANSZ0hsdp1prfxzs" />
<meta name="HandheldFriendly" content="true"/>
<meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
<meta name="apple-mobile-web-app-capable" content="yes">
<meta name="apple-mobile-web-app-status-bar-style" content="black">

 <span class="nl">public:</span>
  <span class="kt">int</span> <span class="n">m1_</span> <span class="o">=</span> <span class="mi">10</span><span class="p">;</span>
  <span class="kt">int</span> <span class="n">m2_</span> <span class="o">=</span> <span class="mi">20</span><span class="p">;</span>
  <span class="kt">int</span> <span class="n">m3_</span> <span class="o">=</span> <span class="mi">30</span><span class="p">;</span>
<span class="p">};</span>
<span class="k">class</span> <span class="nc">Child</span><span class="o">:</span><span class="k">public</span> <span class="n">Parent</span> <span class="p">{</span>
 <span class="nl">public:</span>
  <span class="kt">int</span> <span class="n">m4_</span> <span class="o">=</span> <span class="mi">40</span><span class="p">;</span>
<span class="p">};</span>
<span class="kt">int</span> <span class="n">main</span><span class="p">()</span> <span class="p">{</span>
  <span class="n">cout</span> <span class="o">&lt;&lt;</span> <span class="s">"size of Parent = "</span> <span class="o">&lt;&lt;</span> <span class="k">sizeof</span><span class="p">(</span><span class="n">Parent</span><span class="p">)</span> <span class="o">&lt;&lt;</span> <span class="n">endl</span><span class="p">;</span>
  <span class="n">cout</span> <span class="o">&lt;&lt;</span> <span class="s">"size of Child = "</span> <span class="o">&lt;&lt;</span> <span class="k">sizeof</span><span class="p">(</span><span class="n">Child</span><span class="p">)</span> <span class="o">&lt;&lt;</span> <span class="n">endl</span><span class="p">;</span>
  <span class="n">Child</span><span class="o">*</span> <span class="n">ptr</span> <span class="o">=</span> <span class="k">new</span> <span class="n">Child</span><span class="p">;</span>
  <span class="k">return</span> <span class="mi">0</span><span class="p">;</span>
<span class="p">}</span>
</pre></td></tr></tbody></table></code></pre>
</figure>

<div class="language-plaintext highlighter-rouge"><div class="highlight"><pre class="highlight"><code>size of Parent = 12
size of Child = 16
全域new size = 16
全域 address = 0x600000008030
</code></pre></div></div>

<h3 id="記憶體布局-memory-layout">記憶體布局 Memory layout</h3>

<p>windows使用以下語法</p>
<div class="language-plaintext highlighter-rouge"><div class="highlight"><pre class="highlight"><code>cl 原始檔案 /d1 reportSingleClassLayout類別名
cl test.cpp /d1 reportSingleClassLayoutTestA
</code></pre></div></div>

<h4 id="parent">Parent</h4>
<p>mac使用以下語法<br />
-A 10 代表只印出10筆</p>
<div class="language-plaintext highlighter-rouge"><div class="highlight"><pre class="highlight"><code>clang++ -Xclang -fdump-record-layouts -c 原始檔案.cpp | grep -A 10 "class 類別名"
clang++ -Xclang -fdump-record-layouts -c test1.cpp | grep -A 10 "class Parent"
</code></pre></div></div>

<p>拿上一個範例的程式碼，顯示出來的記憶體布局如下:</p>
<div class="language-plaintext highlighter-rouge"><div class="highlight"><pre class="highlight"><code>         0 | class Parent
         0 |   int m1_
         4 |   int m2_
         8 |   int m3_
           | [sizeof=12, dsize=12, align=4,
           |  nvsize=12, nvalign=4]
</code></pre></div></div>

<ul>
  <li>m1_從0byte開始</li>
  <li>m2_從4byte開始</li>
  <li>m3_從8byte開始</li>
</ul>

<p>int整數大小是4byte，所以Parent類別的大小為12</p>

<h4 id="child">Child</h4>

<div class="language-plaintext highlighter-rouge"><div class="highlight"><pre class="highlight"><code>clang++ -Xclang -fdump-record-layouts -c test1.cpp | grep -A 10 "class Child"
</code></pre></div></div>

<div class="language-plaintext highlighter-rouge"><div class="highlight"><pre class="highlight"><code>         0 | class Child
         0 |   class Parent (base)
         0 |     int m1_
         4 |     int m2_
         8 |     int m3_
        12 |   int m4_
           | [sizeof=16, dsize=16, align=4,
           |  nvsize=16, nvalign=4]
</code></pre></div></div>

<ul>
  <li>Parent m1_從0byte開始</li>
  <li>Parent m2_從4byte開始</li>
  <li>Parent m3_從8byte開始</li>
  <li>Child m4_從12byte開始</li>
</ul>

<p>子類別本身包含了父類別的成員變數，所以Child的大小為16byte。</p>
</section>
            </div><div class="search-results">
    <div class="has-results">
        <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
        <ul class="search-results-list"></ul>
    </div>
    <div class="no-results">
        <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
    </div>
</div></div>
    </div>
</div>

<!-- introduce mathjax support -->
<script>
window.MathJax = {
  tex: {
    inlineMath: [ ['$', '$'], ['\\(', '\\)'] ]
  },
  svg: {
    fontCache: 'global'
  }
};
</script>
<script
  type="text/javascript" id="MathJax-script" async
